Repository: darktable-org/darktable
Catalog: doc/usermanual/po/pl.tmx
Source language: en
Languages: pl

source: source clusters:
pl: skupiska źródłowe:

source: target clusters:
pl: skupiska docelowe:

source: analyze this image as a source image
pl: analizuje ten obraz jako źródłowy

source: analyze this image as a target image
pl: analizuje ten obraz jako docelowy

source: number of clusters to find in image. value change resets all clusters
pl: liczba skupisk do znalezienia na obrazie. zmiana wartości zeruje wszystkie skupiska

source: how clusters are mapped. low values: based on color proximity, high values: based on color dominance
pl: sposób mapowania skupisk. niskie wartości: na podstawie podobieństwa kolorów, wysokie wartości: na podstawie przewagi koloru

source: level of histogram equalization
pl: poziom wyrównania histogramu

source: output color profile
pl: wyjściowy profil koloru

source: missing output profile has been replaced by sRGB!
pl: brakujący profil wyjściowy został zastąpiony przez sRGB!

source: missing softproof profile has been replaced by sRGB!
pl: brakujący profil korekty ekranowej został zastąpiony przez sRGB!

source: unsupported output profile has been replaced by sRGB!
pl: nieobsługiwany profil wyjściowy został zastąpiony przez sRGB!

source: output intent
pl: wyjściowy sposób odwzorowania barw

source: perceptual
pl: percepcyjny

source: relative colorimetric
pl: wzgl. kolorymetryczny

source: absolute colorimetric
pl: bezwzgl. kolorymetryczny

source: rendering intent
pl: sposób odwzorowania barw do renderowania

source: color reconstruction
pl: rekonstrukcja koloru

source: spatial extent
pl: zasięg przestrzenny

source: range extent
pl: zasięg luminancji

source: precedence
pl: pierwszeństwo

source: inconsistent output
pl: niezgodne dane wyjściowe

source: module `color reconstruction' failed
pl: moduł „rekonstrukcja koloru” nieudany

source: saturated colors
pl: nasycone kolory

source: pixels with lightness values above this threshold are corrected
pl: piksele o jasności powyżej tego progu są poprawiane

source: how far to look for replacement colors in spatial dimensions
pl: jak daleko szukać kolorów zastępczych w wymiarach przestrzennych

source: how far to look for replacement colors in the luminance dimension
pl: jak daleko szukać kolorów zastępczych w wymiarze luminancji

source: if and how to give precedence to specific replacement colors
pl: czy i jak przyznać pierwszeństwo konkretnym kolorom zastępczym

source: the hue tone which should be given precedence over other hue tones
pl: odcień, który powinien mieć pierwszeństwo nad innymi odcieniami

source: color transfer
pl: transfer koloru

source: acquire
pl: pobierz

source: apply
pl: zastosuj

source: this module will be removed in the future and is only here so you can switch it off and move to the new color mapping module.
pl: w przyszłości ten moduł zostanie usunięty i jest tu tylko po to, żeby go wyłączyć i korzystać z nowego modułu mapowania.

source: number of clusters to find in image
pl: liczba skupisk do znalezienia na obrazie

source: analyze this image
pl: analizuje ten obraz

source: apply previously analyzed image look to this image
pl: stosuje wygląd poprzednio analizowanego obrazu do tego obrazu

source: color zones
pl: strefy kolorów

source: select by
pl: wybór przez

source: process mode
pl: tryb pracy

source: interpolation method
pl: interpolacja

source: red black white
pl: czerwony czarny biały

source: black white and skin tones
pl: czarny biały i odcienie skóry

source: polarizing filter
pl: filtr polaryzujący

source: natural skin tones
pl: naturalne odcienie skóry

source: black & white film
pl: film czarno-biały

source: cannot display masks when the blending mask is displayed
pl: nie można wyświetlić masek, gdy wyświetlana jest maska mieszania

source: create a curve based on an area from the image drag to create a flat curve ctrl+drag to create a positive curve shift+drag to create a negative curve
pl: utwórz krzywą w oparciu o obszar ze zdjęcia przeciągnij, żeby utworzyć płaską krzywą przeciągnij z ctrl, żeby utworzyć dodatnią krzywą przeciągnij z shift, żeby utworzyć ujemną krzywą

source: edit by area
pl: edytuj zakresy

source: edit the curve nodes by area
pl: edytuj węzły krzywej używając suwaków zakresu

source: display selection
pl: pokaż wybrany zakres

source: choose selection criterion, will be the abscissa in the graph
pl: wybór kryterium podziału, odcięta na wykresie

source: strong
pl: silny

source: choose between a smoother or stronger effect
pl: wybierz między gładszym lub silniejszym efektem

source: centripetal spline
pl: dośrodkowa funkcja sklejana

source: monotonic spline
pl: monotoniczna funkcja sklejana

source: change this method if you see oscillations or cusps in the curve - cubic spline is better to produce smooth curves but oscillates when nodes are too close - centripetal is better to avoids cusps and oscillations with close nodes but is less smooth - monotonic is better for accuracy of pure analytical functions (log, gamma, exp)
pl: zmień tę metodę, jeśli widzisz oscylacje lub ostre wierzchołki w krzywej - sześcienna funkcja sklejana daje gładsze krzywe, ale oscyluje, gdy węzły są zbyt blisko - dośrodkowa powoduje mniej oscylacji i wierzchołków przy bliskich węzłach, ale jest mniej gładka - monotoniczna ma lepszą dokładność dla czysto analitycznych funkcji (log, gamma, exp)

source: defringe
pl: usuwanie obwódek

source: edge detection radius
pl: promień wykrywania krawędzi

source: operation mode
pl: tryb działania

source: global average (fast)
pl: średnia globalna (szybkie)

source: local average (slow)
pl: średnia lokalna (wolne)

source: static threshold (fast)
pl: statyczny próg (szybkie)

source: method for color protection: - global average: fast, might show slightly wrong previews in high magnification; might sometimes protect saturation too much or too low in comparison to local average - local average: slower, might protect saturation better than global average by using near pixels as color reference, so it can still allow for more desaturation where required - static: fast, only uses the threshold as a static limit
pl: metoda ochrony kolorów: - średnia globalna: szybka, podgląd może być nieznacznie błędny w dużym powiększeniu; może czasem zbyt mocno lub zbyt słabo zachowywać nasycenie w porównaniu ze średnią lokalną - średnia lokalna: wolniejsza, może lepiej zachowywać nasycenie niż średnia globalna poprzez wykorzystanie pobliskich pikseli jako odniesienia umożliwiając więcej desaturacji, gdy jest to potrzebne - statyczna: szybka, używa tylko progu jako statycznej granicy

source: radius for detecting fringe
pl: promień wykrywania obwódek

source: threshold for defringe, higher values mean less defringing
pl: próg usuwania obwódek, większe wartości oznaczają słabsze działanie

source: demosaic
pl: demozaikowanie

source: edge threshold
pl: próg krawędzi

source: method (bayer)
pl: metoda (bayer)

source: method (xtrans)
pl: metoda (xtrans)

source: color smoothing
pl: wygładzanie koloru

source: match greens
pl: dopasuj zieleń

source: `%s' color matrix not found for 4bayer image!
pl: nie znaleziono macierzy koloru „%s” dla zdjęcia 4bayer!

source: method
pl: metoda

source: PPG (fast)
pl: PPG (szybkie)

source: AMaZE (slow)
pl: AMaZE (wolne)

source: passthrough (monochrome) (experimental)
pl: brak (monochromatyczne) (opcja eksperymentalna)

source: demosaicing raw data method
pl: metoda demozaikowania danych raw

source: Markesteijn 1-pass
pl: Markesteijn (jednoprzebiegowe)

source: Markesteijn 3-pass (slow)
pl: Markesteijn (trójprzebiegowe - wolne)

source: frequency domain chroma (slow)
pl: chroma z dziedziny częstotliwości (wolne)

source: threshold for edge-aware median. set to 0.0 to switch off. set to 1.0 to ignore edges.
pl: próg dla mediany krawędzi. ustaw 0.0, aby wyłączyć. ustaw 1.0, aby zignorować krawędzie.

source: one time
pl: jeden raz

source: two times
pl: dwa razy

source: three times
pl: trzy razy

source: four times
pl: cztery razy

source: five times
pl: pięć razy

source: how many color smoothing median steps after demosaicing
pl: liczba przejść mediany wygładzania koloru po demozaikowaniu

source: disabled
pl: wyłączone

source: local average
pl: średnia miejscowa

source: full average
pl: średnia pełna

source: full and local average
pl: średnia pełna i miejscowa

source: green channels matching method
pl: metoda dopasowania kanałów zielonych

source: demosaicing only needed for raw images.
pl: demozaikowanie potrzebne tylko dla obrazów raw.

source: denoise (profiled)
pl: odszumianie (profilowane)

source: adjust autoset parameters
pl: dostosuj parametry automatycznie

source: preserve shadows
pl: ochrona cieni

source: bias correction
pl: korekcja przesunięcia kolorów

source: patch size
pl: rozmiar łatki

source: search radius
pl: promień szukania

source: scattering
pl: rozpraszanie

source: central pixel weight
pl: waga centralnego piksela (detale)

source: found match for ISO %d
pl: znaleziono dla ISO %d

source: interpolated from ISO %d and %d
pl: interpolowane z ISO %d i %d

source: compute variance
pl: oblicz wariancję

source: use only with a perfectly uniform image if you want to estimate the noise variance.
pl: używaj wyłącznie z perfekcyjnie jednolitym obrazem jeśli chcesz estymować wariancję szumu

source: variance red:
pl: wariancja czerwonego:

source: variance computed on the red channel
pl: wariancja wyliczona z kanału czerwonego

source: variance green:
pl: wariancja zielonego:

source: variance computed on the green channel
pl: wariancja wyliczona z kanału zielonego

source: variance blue:
pl: wariancja niebieskiego:

source: variance computed on the blue channel
pl: wariancja wyliczona z kanału niebieskiego

source: whitebalance-adaptive transform
pl: dostosuj do balansu bieli

source: adapt denoising according to the white balance coefficients. should be enabled on a first instance for better denoising. should be disabled if an earlier instance has been used with a color blending mode.
pl: zaadaptuj odszumianie zgodnie z współczynnikami balansu bieli. powinno być włączone w pierwszej instancji dla lepszego odszumiania. powinno być wyłączone, jeżeli wcześniejsza instancja była użyta z trybem mieszania koloru.

source: fix various bugs in algorithm
pl: napraw błędy w algorytmie

source: fix bugs in anscombe transform resulting in undersmoothing of the green channel in wavelets mode, combined with a bad handling of white balance coefficients, and a bug in non local means normalization resulting in undersmoothing when patch size was increased. enabling this option will change the denoising you get. once enabled, you won't be able to return back to old algorithm.
pl: popraw błędy w transformacji anscombe'a powodujące zbytnie wygładzenie zielonego kanału w trybie falkowym, połączone ze złą obsługą współczynników balansu bieli oraz błąd w normalizacji nielokalnych średnich powodujący zbytnie wygładzenie, gdy rozmiar łatki był zwiększony. włączenie tej opcji zmieni odszumianie, które otrzymujesz. po włączeniu nie będzie można wrocić do starego algorytmu.

source: upgrade profiled transform
pl: zaktualizuj transformatę profilowaną

source: upgrade the variance stabilizing algorithm. new algorithm extends the current one. it is more flexible but could give small differences in the images already processed.
pl: zaktualizuj algorytm stabilizacji wariancji. nowy algorytm jest rozszerzeniem obecnego. jest bardziej elastyczny, ale może dać niewielkie różnice w przypadku już obrabianych obrazów.

source: profile
pl: profil

source: color mode
pl: tryb koloru

source: scattering (coarse-grain noise)
pl: rozproszenie (gruby szum ziarnisty)

source: central pixel weight (details)
pl: waga centralnego piksela (detale)

source: non-local means
pl: średnie nielokalne

source: non-local means auto
pl: średnie nielokalne auto

source: wavelets
pl: falki

source: wavelets auto
pl: falki auto

source: profile used for variance stabilization
pl: profil użyty do stabilizacji wariancji

source: method used in the denoising core. non-local means works best for `lightness' blending, wavelets work best for `color' blending
pl: metoda odszumiania. średnie nielokalne działają najlepiej dla trybu mieszania „jasność”, falki działają najlepiej dla trybu mieszania „kolor”

source: color representation used within the algorithm. RGB keeps the RGB channels separated, while Y0U0V0 combine the channels to denoise chroma and luma separately.
pl: reprezentacja koloru używana przez algorytm. RGB używa oddzielnych kanałów R, G i B, podczas gdy Y0U0V0 łączy je aby oddzielnie odszumiać kanały kolorów i luminancji.

source: radius of the patches to match. increase for more sharpness on strong edges, and better denoising of smooth areas. if details are oversmoothed, reduce this value or increase the details slider.
pl: promień łatek do dopasowania. zwiększ, aby uzyskać więcej ostrości na mocnych krawędziach i lepsze odszumianie gładkich obszarów. jeśli detale są zbytnio wygładzone, zmniejsz tę wartość lub zwiększ suwak detali.

source: emergency use only: radius of the neighbourhood to search patches in. increase for better denoising performance, but watch the long runtimes! large radii can be very slow. you have been warned
pl: do użytku tylko w wyjątkowych przypadkach: promień otoczenia do poszukiwania łatek. zwiększ w celu lepszej efektywności odszumiania, ale uważaj na długie czasy działania! duże promienie mogą działać bardzo wolno. zostałeś ostrzeżony

source: scattering of the neighbourhood to search patches in. increase for better coarse-grain noise reduction. does not affect execution time.
pl: rozproszenie otoczenia, w którym należy szukać łatek. zwiększ, żeby uzyskać lepszą redukcję grubego szumu ziarnistego. nie wpływa na czas wykonania.

source: increase the weight of the central pixel of the patch in the patch comparison. useful to recover details when patch size is quite big.
pl: zwiększ wagę centralnego piksela łatki w porównywaniu łatek. użyteczne, aby odzyskać detale, gdy rozmiar łatki jest dość duży.

source: finetune denoising strength
pl: dostrój siłę odszumiania

source: controls the way parameters are autoset increase if shadows are not denoised enough or if chroma noise remains. this can happen if your picture is underexposed.
pl: ustala jak działa automatyczne ustawianie parametrów zwiększ, jeśli cienie nie są dostatecznie odszumione lub jeśli szum kolorowy wciąż jest widoczny. to może mieć miejsce, jeśli obraz jest niedoświetlony.

source: finetune shadows denoising. decrease to denoise more aggressively dark areas of the image.
pl: dostrajanie odszumiania cieni zmniejsz aby ciemne obszary obrazu były odszumiane bardziej agresywnie.

source: correct color cast in shadows. decrease if shadows are too purple. increase if shadows are too green.
pl: skoryguj koloryzację cieni zmniejsz, jeśli cienie są zbyt purpurowe zwiększ, jeśli cienie są zbyt zielone

source: dither
pl: dithering

source: random
pl: losowa

source: floyd-steinberg 1-bit B&W
pl: floyd-steinberg 1-bit cz/b

source: floyd-steinberg 4-bit gray
pl: floyd-steinberg 4-bit szary

source: radius for blurring step
pl: promień dla fazy rozmycia

source: the gradient range where to apply random dither
pl: zakres gradientu, w którym ma zostać zastosowany losowy dithering

source: gradient range
pl: zakres gradientu

source: damping level of random dither
pl: poziom tłumienia losowego ditheringu

source: damping
pl: tłumienie

source: legacy equalizer
pl: przestarzały korektor

source: sharpen (strong)
pl: wyostrzenie (silne)

source: null
pl: bez zmian

source: denoise (strong)
pl: odszumienie (silne)

source: this module will be removed in the future and is only here so you can switch it off and move to the new equalizer.
pl: w przyszłości ten moduł zostanie usunięty i jest tu tylko po to, żeby go wyłączyć i korzystać z nowego korektora.

source: black
pl: czerń

source: auto-exposure
pl: auto-ekspozycja

source: percentile
pl: percentyl

source: target level
pl: docelowy poziom

source: magic lantern defaults
pl: domyślne wartości magic lantern

source: failed to get raw buffer from image `%s'
pl: nieudane pobranie bufora raw z obrazu „%s”

source: manual
pl: ręczny

source: automatic
pl: auto

source: adjust the black level to unclip negative RGB values. you should never use it to add more density in blacks! if poorly set, it will clip near-black colors out of gamut by pushing RGB values into negatives.
pl: zmień poziom czerni, żeby odzyskać ujemne wartości RGB. nigdy nie powienieś tego używac, żeby dodawać więcej gęstosci w czerniach! złe ustawienie spowoduje wypadnięcie kolorów bliskich czerni poza gamut przesuwając wartości RGB poniżej zera.

source: percentage of bright values clipped out, toggle color picker to activate
pl: procent prześwietlonych jasnych wartości, przełącz próbnik koloru, by włączyć

source: clipping threshold
pl: próg odcinania

source: where in the histogram to meter for deflicking. E.g. 50% is median
pl: w którym miejscu histogramu wykonać pomiar. Np. 50% dla mediany

source: where to place the exposure level for processed pics, EV below overexposure.
pl: jaką otrzymać ekspozycję przetworzonego zdjęcia, ilość stopni EV poniżej prześwietlenia.

source: computed EC:
pl: wyliczone EC:

source: what exposure correction has actually been used
pl: jaka korekcja ekspozycji została rzeczywiście zastosowana

source: filmic
pl: krzywa filmowa

source: 10 EV (indoors)
pl: 10 EV (wnętrze)

source: 11 EV (dim outdoors)
pl: 11 EV (ciemne zewnętrze)

source: 12 EV (outdoors)
pl: 12 EV (zewnętrze)

source: 13 EV (bright outdoors)
pl: 13 EV (jasne zewnętrzne)

source: 14 EV (backlighting)
pl: 14 EV (podświetlenie od tyłu)

source: 15 EV (sunset)
pl: 15 EV (zachód słońca)

source: read-only graph, use the parameters below to set the nodes
pl: wykres tylko do podglądu, użyj parametrów poniżej, aby regulować węzły

source: logarithmic shaper
pl: kształtowanie logarytmiczne

source: middle grey luminance
pl: luminancja średniej szarości

source: adjust to match the average luminance of the subject. except in back-lighting situations, this should be around 18%.
pl: zmień, aby wybrać średnią luminancję obiektu. z wyjątkiem sytuacji z podświetleniem od tyłu, powinno być ok. 18%.

source: white relative exposure
pl: względna ekspozycja bieli

source: number of stops between middle grey and pure white. this is a reading a lightmeter would give you on the scene. adjust so highlights clipping is avoided
pl: ilość działek przesłony między średnią szarością, a czystą bielą. jest to wskazanie, które w tej scenie dałby światłomierz. zmień, aby uniknąć prześwietlenia świateł

source: black relative exposure
pl: względna ekspozycja czerni

source: number of stops between middle grey and pure black. this is a reading a lightmeter would give you on the scene. increase to get more contrast. decrease to recover more details in low-lights.
pl: ilość działek przesłony między średnią szarością, a czystą czernią. jest to wskazanie, które w tej scenie dałby światłomierz. zwiększ, aby uzyskać większy kontrast. zmniejsz, aby odzyskać więcej detali w cieniach.

source: safety factor
pl: współczynnik bezpieczeństwa

source: enlarge or shrink the computed dynamic range. useful in conjunction with "auto tune levels".
pl: zwiększ lub zmniejsz wyliczoną rozpiętość tonalną. przydatne w połączeniu z automatycznym ustawianiem poziomów.

source: auto tune levels
pl: ustaw poziomy automatycznie

source: try to optimize the settings with some guessing. this will fit the luminance range inside the histogram bounds. works better for landscapes and evenly-lit pictures but fails for high-keys and low-keys.
pl: spróbuj zoptymalizować ustawienia z odrobiną zgadywania. dopasuje to zakres luminancji do ograniczeń histogramu. działa lepiej z krajobrazami i równo oświetlonymi zdjęciami ale szwankuje w przypadku high-key i low-key.

source: filmic S curve
pl: filmowa krzywa S

source: slope of the linear part of the curve affects mostly the mid-tones
pl: nachylenie liniowej części krzywej wpływa głownie na tony średnie

source: latitude
pl: szerokość

source: width of the linear domain in the middle of the curve. increase to get more contrast at the extreme luminances. this has no effect on mid-tones.
pl: szerokość liniowego przedziału w środkowej części krzywej. zwiększ, aby mieć więcej kontrastu w skrajnych luminancjach. nie ma wpływu na tony średnie.

source: shadows/highlights balance
pl: balans cieni i świateł

source: slides the latitude along the slope to give more room to shadows or highlights. use it if you need to protect the details at one extremity of the histogram.
pl: przesuwa część liniową na krzywej, aby przeznaczyć więcej miejsca na cienie lub światła. użyj, jeśli potrzebujesz chronić detale na jednym z końców histogramu.

source: global saturation
pl: nasycenie globalne

source: desaturates the input of the module globally. you need to set this value below 100% if the chrominance preservation is enabled.
pl: globalnie zmniejsza nasycenie wejścia. trzeba ustawić tę wartość poniżej 100%, jeżeli zachowanie chrominancji jest włączone.

source: extreme luminance saturation
pl: nasycenie skrajnych luminancji

source: desaturates the output of the module specifically at extreme luminances. decrease if shadows and/or highlights are over-saturated.
pl: zmniejsza nasycenie wyjścia modułu. dla skrajnych luminancji. zmniejsz, jeśli cienie i/lub światła są zbytnio nasycone.

source: intent
pl: odwzorowanie barw

source: contrasted
pl: skontrastowane

source: faded
pl: wyblakłe

source: optimized
pl: zoptymalizowane

source: change this method if you see reversed contrast or faded blacks
pl: zmień tę metodę, jeśli zauważysz odwrócony kontrast lub wyblakłe czernie

source: preserve the chrominance
pl: zachowaj chrominancję

source: ensure the original color are preserved. may reinforce chromatic aberrations. you need to manually tune the saturation when using this mode.
pl: zapewnij, aby oryginalny kolor został zachowany. może wzmocnić aberracje chromatyczne. używając tego trybu trzeba ręcznie wyregulować nasycenie.

source: destination/display
pl: cel/wyświetlacz

source: target black luminance
pl: docelowa luminancja czerni

source: luminance of output pure black, this should be 0% except if you want a faded look
pl: luminancja wyjściowej czystej czerni, powinna wynosić 0% chyba że chcesz otrzymać wyblakły wygląd

source: target middle grey
pl: docelowa średnia szarość

source: midde grey value of the target display or color space. you should never touch that unless you know what you are doing.
pl: wartość średniej szarości docelowego wyświetlacza lub przestrzeni kolorów. nie powinieneś tego zmieniać, chyba że wiesz, co robisz.

source: target white luminance
pl: docelowa luminancja bieli

source: luminance of output pure white, this should be 100% except if you want a faded look
pl: luminancja wyjściowej czystej bieli, powinna wynosić 100% chyba że chcesz otrzymać wyblakły wygląd

source: target gamma
pl: docelowa gamma

source: power or gamma of the transfer function of the display or color space. you should never touch that unless you know what you are doing.
pl: potęga lub gamma funkcji przejścia wyświetlacza lub przestrzeni kolorów. nie powinieneś tego zmieniać, chyba że wiesz, co robisz.

source: filmic rgb
pl: krzywa filmowa rgb

source: 07 EV dynamic range
pl: rozpiętość tonalna 7 EV

source: 09 EV dynamic range
pl: rozpiętość tonalna 9EV

source: 11 EV dynamic range
pl: rozpiętość tonalna 11 EV

source: 13 EV dynamic range
pl: rozpiętość tonalna 13 EV

source: 15 EV (backlighting)
pl: 15 EV (podświetlenie od tyłu)

source: white exposure
pl: ekspozycja bieli

source: black exposure
pl: ekspozycja czerni

source: dynamic range scaling
pl: skalowanie rozpiętości tonalnej
